# 產品選型規則

# . 代表任何字
# + 代表1次以上
# * 代表0此以上
# ? 代表0或1次
# .{n} 代表n次  .{n}(S11|S12).+ 

# 1Ny2tq87Pviz  PA10VO系列

dic_input = {
    # 主動選型規則(5個參數) (單一選項  將互相針對) ;
    'both' : [
        # '10vo [A, B, C, D, E, F];        -u 05ct [001, 00G, HLA, HLB, HLC, 00C, 0CG, 0CR, 0GM, 0LN, 0LC]',
       '04ct  [00DRS];              -u 09ln [A, C]',
       '05sr  [52];                 -u 03dp [018, 028, 045, 060, 063, 085, 100]',
       '05sr  [53];                 -u 03dp [010, 018, 028, 045, 085, 100]',
       '08axv [R2, R3, R4, R5];     -u 03dp [010, 085, 100]',
       '08axv [U1, U2, U4, U5];     -u 03dp [028]',
       '08axv [W4, W5];             -u 03dp [010, 018, 028]',
       '08axv [P1, P2];             -u 03dp [028, 045, 060, 063, 085, 100]',
       '09ln  [D];                  -u 03dp [010, 018, 028, 045, 100]',
       '10dn  [12];                 -u 03dp [010]',
       '10dn  [14];                 -u 03dp [018, 028, 045, 060, 063, 085, 100]',
    ],

    # 主動選型規則(4個參數)
    'lion': [
        # 型號表達式 ; 1:mode -u不能選|-s僅能選  2 lion_model 3 items
        # '^.{2}(065|110|123).+;                       -u 04pa [4]',

    ],

# 碼數
# 01 02 03 04 05 06 07 08 09 10 11 12
# 5  1  3  5  2  1  1  2  1  2  3  1

    # 篩選規則 4個參數
    'filter': [ 
        # '^.{2}(016|020|023|028).+;           06ln [M1, K1, R1, S1, N1, D1, J1, U1]',   # 吻合345碼(排量為016,020,023,028時) 06軸心 篩選 M,K,R,S,N,D,J,U 其它將不顯示
        '^.{18}(010).+;       08axv [S1, U1, P1]', 
        '^.{18}(018).+;       08axv [S2, R2, U2, P2]',
        '^.{18}(028).+;       08axv [S3, R3]',
        '^.{18}(045).+;       08axv [S4, R4, U4, W4]',
        '^.{18}(060|063).+;   08axv [S5, R5, U5, W5]',
        '^.{18}(085|100).+;   08axv [S6, U6, W6]',

    ],

    # 別名規則 3個參數
    'alias': [
        '03dp 010 10',
        '03dp 018 18',  # 01ver 的選型 0  將顯示別名 □
        '03dp 028 28',
        '03dp 045 45',
        '03dp 060 60',
        '03dp 063 63',
        '03dp 085 85',
        '04ct 000DR DR',
        '04ct 00DRL DRL',
        '04ct 00DRG DRG',
        '04ct 0DRGL DRGL',
        '04ct 00DFR DFR',
        '04ct 00DRF DRF',
        '04ct 0DFR1 DFR1',
        '04ct 00DRS DRS',
        '04ct 0ED71 ED71',
        '04ct 0ED72 ED72',
        '04ct 0ER71 ER71',
        '04ct 0ER72 ER72',
        '04ct 0LA5D LA5D',
        '04ct 0LA6D LA6D',
        '04ct 0LA7D LA7D',
        '04ct 0LA8D LA8D',
        '04ct 0LA9D LA9D',
        '08axv S1 S',
        '08axv U1 U',
        '08axv P1 P',
        '08axv S2 S',
        '08axv R2 R',
        '08axv U2 U',
        '08axv P2 P',
        '08axv S3 S',
        '08axv R3 R',
        '08axv S4 S',
        '08axv R4 R',
        '08axv U4 U',
        '08axv W4 W',
        '08axv S5 S',
        '08axv R5 R',
        '08axv U5 U',
        '08axv W5 W',
        '08axv S6 S',
        '08axv U6 U',
        '08axv W6 W',
        '12sd 0 □',
    ],

    # supply 指定供貨規則
    'supply': [
        '^(PA10V).+;             03dp  [010, 018, 028, 045, 085, 100] n',
        '^(PA10V).+;             04ct  [EF.D., LA.DG, LA.DS, 0LA.S] n',
        '^(PA10V).+;             10dn  [11, 13] n',
        '^(PA10V).+;             11th  [K01, K52, K68, K04, K15, K16, K07, K24] n',

        # '^.{8}(018|028|045|071).+;       09axv [U1, U2, U3, U4, U5] d',
    ],

    # fast_model 快速選型  (完整型號 空格區隔 不可相連)
    'fast_model' : [
        # 單元    工作模式   排量    控制    系列    旋轉   油封    軸心    法蘭    油路口  通軸驅動  特殊規格
        # 01un    02md      03dp   04ct    05sr    06cr   07se   08axv   09ln   10dn    11th     12sd
        # ' PA10V   O         063    00DRS   53      L      V      X5      C      12      N00      0', # PA10VO63DRS/53L-VXC12N00
        # ' PA10V   O         063    LA8DS   53      R      V      U5      C      12      N00      0', # PA10VO63LA8DS/53R-VUC12N00
    ],
                      


    # 隱藏規則(尚未處理)
    'pdmodel_hide': [

    ],

}
